import { Card, Container, Typography } from "@mui/material";
import fastLoremIpsum from "fast-lorem-ipsum";

const About = () => {
  return (
    <Container
      sx={{
        display: "flex",
        flexDirection: "column",
        justifyContent: "center",
        alignItems: "center",
      }}
    >
      <Typography variant="h2" justifyContent="center">
        עלינו
      </Typography>
      <Typography variant="h4">
        באתר שלנו, אנו חוגגים את האמנות והיצירתיות של עולם המקרמה. כל פריט
        שתמצאו כאן הוא פרי עבודה מדויקת ומוקפדת, המבוססת על טכניקות מסורתיות עם
        טוויסט עכשווי. מהתחלה ועד הסוף, אנחנו שואפים להביא לכם מוצרים ייחודיים
        שיגרמו לכם להרגיש מחוברים לטבע, לאומנות ולסטייל. כל יצירה באתר נוצרת
        באהבה ובתשומת לב לפרטים הקטנים, כדי להעניק לכם תכשיטים ואביזרים שמשלבים
        עיצוב מרהיב עם איכות בלתי מתפשרת.
        <br />
        <br />
        החזון שלנו הוא ליצור עולם שבו אמנות המקרמה פוגשת את היומיום. אנו מאמינים
        שהפריטים שלנו לא רק יוסיפו יופי לחייכם, אלא גם יישאו עימם אנרגיות
        חיוביות ומשמעות רגשית. כל פריט בעבודת יד מסמל יצירתיות, אותנטיות וקשר
        עמוק לטבע ולאומנויות המסורתיות, ומיועד לאלו שמחפשים ביטוי אישי דרך
        האופנה.
        <br />
        <br />
        אנחנו כאן כדי להעניק לכם חוויית קנייה ייחודית, שבה כל פריט מספר סיפור
        ומביא עמו נגיעה אישית. בין אם אתם מחפשים תכשיט ייחודי, אביזר לשיער או
        מתנה מושלמת לאהובים, אנו בטוחים שתמצאו את מה שאתם מחפשים. ברוכים הבאים
        לעולם של מקרמה בעבודת יד, שבו כל קשר מספר סיפור וכל יצירה היא יצירת
        אמנות.
      </Typography>
    </Container>
  );
};

export default About;
